### Terraform Plan for `team-alpha` 📋

#### Initialization ⚙️ `success`
#### Validation 🤖 `success`
#### Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.bucket_test_342342342.module.cloud_storage.google_storage_bucket.buckets["test-342342342"] will be created
  + resource "google_storage_bucket" "buckets" {
      + default_event_based_hold    = false
      + effective_labels            = {
          + "managed_by" = "backstage"
          + "name"       = "test-342342342"
          + "team"       = "team-alpha"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "managed_by" = "backstage"
          + "name"       = "test-342342342"
          + "team"       = "team-alpha"
        }
      + location                    = "US"
      + name                        = "test-342342342"
      + project                     = "fast-pagoda-474409-c7"
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "managed_by" = "backstage"
          + "name"       = "test-342342342"
          + "team"       = "team-alpha"
        }
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + autoclass {
          + enabled                = false
          + terminal_storage_class = (known after apply)
        }

      + versioning {
          + enabled = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @sajjadkhan12, Action: `pull_request`*